2309/src/Catalogs/products/products.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>products</name>
  <attributes>
    <name>addDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>endDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>fullDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>photo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>shortDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>startDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>composition</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>attribute</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>order</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>photos</name>
    <attributes>
      <name>URL</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>tags</name>
    <attributes>
      <name>tag</name>
      <type>
        <types>CatalogRef.tags</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>translation</name>
    <attributes>
      <name>addDescription</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>fullDescription</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>language</name>
      <type>
        <types>CatalogRef.languages</types>
      </type>
    </attributes>
    <attributes>
      <name>shortDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>content</name>
    <attributes>
      <name>contentRef</name>
      <type>
        <types>CatalogRef.content</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>authors</name>
    <attributes>
      <name>author</name>
      <type>
        <types>CatalogRef.employees</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

2309/src/Catalogs/products/ManagerModule.bsl
Function attributesStructure() Export

	attributesTable = DataLoad.getValueTable();
	attributesTableForNewItem = DataLoad.getValueTable();

	DataLoad.addRowInAttributesTable(attributesTable, "description", "description", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "shortDescription", "shortDescription", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "fullDescription", "fullDescription", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "addDescription", "addDescription", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "photo", "photo", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "startDate", "startDate", "date");
	DataLoad.addRowInAttributesTable(attributesTable, "endDate", "endDate", "date");
	DataLoad.addRowInAttributesTable(attributesTable, "order", "order", "number");
	DataLoad.addRowInAttributesTable(attributesTable, "composition", "composition", "JSON");
	DataLoad.addRowInAttributesTable(attributesTable, "attribute", "attribute", "JSON");	
	
	DataLoad.addRowInAttributesTable(attributesTable, "translation", "translation", "valueTable");
	DataLoad.addRowInAttributesTable(attributesTable, "photos", "photos", "valueTable");
	DataLoad.addRowInAttributesTable(attributesTable, "tags", "tags", "valueTable");
	DataLoad.addRowInAttributesTable(attributesTable, "authors", "authors", "valueTable");
	DataLoad.addRowInAttributesTable(attributesTable, "content", "content", "valueTable");
	
	attributesTranslation = DataLoad.getValueTable();

	DataLoad.addRowInAttributesTable(attributesTranslation, "language", "language", "ref");
	DataLoad.addRowInAttributesTable(attributesTranslation, "description", "description", "string");
	DataLoad.addRowInAttributesTable(attributesTranslation, "shortDescription", "shortDescription", "string");
	DataLoad.addRowInAttributesTable(attributesTranslation, "fullDescription", "fullDescription", "string");
	DataLoad.addRowInAttributesTable(attributesTranslation, "addDescription", "addDescription", "string");
	
	attributesPhotos = DataLoad.getValueTable();
	DataLoad.addRowInAttributesTable(attributesPhotos, "URL", "URL", "string");
	
	attributesTags = DataLoad.getValueTable();
	DataLoad.addRowInAttributesTable(attributesTags, "tag", "tag", "ref");
	
	attributesContent = DataLoad.getValueTable();
	DataLoad.addRowInAttributesTable(attributesContent, "contentRef", "contentRef", "ref");
	
	attributesAuthor = DataLoad.getValueTable();
	DataLoad.addRowInAttributesTable(attributesAuthor, "author", "author", "ref");

	mdStruct = New Structure();
	mdStruct.Insert("translation", attributesTranslation);
	mdStruct.Insert("photos", attributesPhotos);
	mdStruct.Insert("tags", attributesTags);
	mdStruct.Insert("content", attributesContent);
	mdStruct.Insert("language", New Structure("languages", "code"));
	mdStruct.Insert("tag", New Structure("tags", "uid"));
	mdStruct.Insert("contentRef", New Structure("content", "uid"));
	mdStruct.Insert("authors", attributesAuthor);
	mdStruct.Insert("author", New Structure("employees", "uid"));
	
	Return New Structure("fillHolding, mdObjectName, mdType, actType, attributesTable, attributesTableForNewItem, mdStruct", True, "products", "catalog", "write", attributesTable, attributesTableForNewItem, mdStruct);

EndFunction
